import keyboard
import time
def render():
    for i in mapa:
     print(*i)
print("Використовуй стрілки для руху")

mapa = [
    ["*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*"],  # рядок 0
    ["*", " ", "*", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", "*"],  # рядок 1
    ["*", " ", "*", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", " ", "*"],  # рядок 2
    ["*", " ", "*", " ", " ", " ", "*", " ", " ", " ", "*", " ", " ", " ", "*"],  # рядок 3
    ["*", " ", " ", " ", "*", "*", "*", " ", " ", " ", "*", " ", " ", " ", "*"],  # рядок 4
    ["*", " ", " ", " ", "*", " ", " ", " ", " ", "*", "*", "*", " ", " ", "*"],  # рядок 5
    ["*", " ", " ", " ", "*", " ", " ", " ", " ", " ", "*", " ", " ", " ", "*"],  # рядок 6
    ["*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*", "*"]  # рядок 7
    # ел. 0   1    2    3    4    5    6    7    8    9    10   11   12   13   14
]

x = 1
y = 1

mapa[x][y] = "@"




while True:
    moved = False
    if keyboard.is_pressed("up"):
        mapa[x][y] = " "
        x -= 1
        moved = True
    elif keyboard.is_pressed("down"):
        mapa[x][y] = " "
        x += 1
        moved = True
    elif keyboard.is_pressed("left"):
        mapa[x][y] = " "
        y -= 1
        moved = True
    elif keyboard.is_pressed("right"):
        mapa[x][y] = " "
        y += 1
        moved = True

    if moved:
     mapa[x][y] = "@"
     render()
     time.sleep(0.1)



